FV2304/E_0476.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
GPKE

6.29.1: AD: Reklamation einer Zählzeitdefinition des NB vom LF an NB



end title
:<b>E_0476</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>1: </b> Reklamiert der LF eine fehlende Übersicht der Zählzeitdefinition?) then (ja)
    if (<b>2: </b> Wurde die Übersicht der Zählzeitdefinition an den LF versendet?) then (ja)
        :A01;
        note left
            Übersicht der Zählzeitdefinition wurde versendet
        endnote
        kill;
    else (nein)
    endif
    if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Sonstiges
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
        endnote
        kill;
    else (nein)
        :Korrektur der Übersicht der Zählzeitdefinition bzw. Korrektur der ausgerollten Zählzeitdefinition und die erneute Übermittlung durchführen.;
        kill;
    endif
else (nein)
    if (<b>3: </b> Reklamiert der LF eine unplausible Übersicht der Zählzeitdefinition?) then (ja)
        if (<b>4: </b> Ist die versendete Übersicht der Zählzeitdefinition plausibel?) then (ja)
            :A02;
            note left
                Übersicht der Zählzeitdefinition ist plausibel
            endnote
            kill;
        else (nein)
        endif
        if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Sonstiges
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
            endnote
            kill;
        else (nein)
            :Korrektur der Übersicht der Zählzeitdefinition bzw. Korrektur der ausgerollten Zählzeitdefinition und die erneute Übermittlung durchführen.;
            kill;
        endif
    else (nein)
        if (<b>5: </b> Reklamiert der LF das Fehlen der ausgerollten Zählzeitdefinition?) then (ja)
            if (<b>6: </b> Entspricht der Code der Zählzeit einem Code aus der für den reklamierten Zeitraum gültigen Übersicht der Zählzeitdefinitionen?) then (ja)
            else (nein)
                :A03;
                note left
                    Code der Zählzeit wird nicht verwendet
                endnote
                kill;
            endif
            if (<b>7: </b> Wurde die ausgerollte Zählzeitdefinition an den LF versendet?) then (ja)
                :A04;
                note left
                    Ausgerollte Zählzeitdefinition wurde versendet
                endnote
                kill;
            else (nein)
            endif
            if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
                :A99;
                note left
                    Sonstiges
                    Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                    Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
                endnote
                kill;
            else (nein)
                :Korrektur der Übersicht der Zählzeitdefinition bzw. Korrektur der ausgerollten Zählzeitdefinition und die erneute Übermittlung durchführen.;
                kill;
            endif
        else (nein)
            if (<b>8: </b> Reklamiert der LF eine unplausible ausgerollte Zählzeitdefinition?) then (ja)
                if (<b>9: </b> Wurde mit dem Code der Zählzeit bereits eine ausgerollte Zählzeitdefinition mit einer höheren Version versendet?) then (ja)
                    :A05;
                    note left
                        Es wurde bereits eine aktuellere ausgerollte Zählzeitdefinition für den Code der Zählzeit versendet
                    endnote
                    kill;
                else (nein)
                endif
                if (<b>10: </b> Ist die versendete ausgerollte Zählzeitdefinition plausibel?) then (ja)
                    :A06;
                    note left
                        Ausgerollte Zählzeitdefinition ist plausibel
                    endnote
                    kill;
                else (nein)
                endif
                if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
                    :A99;
                    note left
                        Sonstiges
                        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                        Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
                    endnote
                    kill;
                else (nein)
                    :Korrektur der Übersicht der Zählzeitdefinition bzw. Korrektur der ausgerollten Zählzeitdefinition und die erneute Übermittlung durchführen.;
                    kill;
                endif
            else (nein)
            endif
        endif
    endif
endif
if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
        Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
    endnote
    kill;
else (nein)
    :Korrektur der Übersicht der Zählzeitdefinition bzw. Korrektur der ausgerollten Zählzeitdefinition und die erneute Übermittlung durchführen.;
    kill;
endif

@enduml
